
UP_CHEAT_CNT = 20  # 单次筛选的用于校验的battleId的数量

TIME_FORMAT = '%Y-%m-%d %H:%M:%S'

BattleCheatDescription = {
    0: "NoCheat",  # 无作弊
    101: "FunctionReplace",  # 函数替换
    102: 'PropertyChange',  # 属性修改
    103: 'PropChange',  # 局内道具修改
    104: 'SkillChange',  # 技能属性修改
    105: 'ByteChange',  # 二进制文件修改
    106: 'CodeChange',  # 代码段修改

    200: 'ResourceOverflow',  # 资源掉落超限
    201: 'QuickWin',  # 战斗时间不足，迅速获胜
    202: 'NotConsistent',  # 多人战场发生不一致
    301: 'AceReport',  # ACE的部分上报
    401: 'PlayerReport',  # 玩家举报
    901: 'RankListTop',  # 排行榜上榜玩家
    902: 'AceCertError',  # ace证书异常

    998: 'CheatSummary',  # 作弊行为汇总
    999: 'CheatOpBlock',  # 作弊上传被屏蔽
}

BattleCheatPriority = {
    0: 0,
    101: 50,
    102: 50,
    103: 80,
    104: 50,
    105: 30,
    106: 30,
    200: 20,
    201: 50,
    202: 10,
    301: 10,
    401: 10,
    901: 10,
    902: 50,

    998: 30,
    999: 30,
}

BattleCheatOperation = {
    # 战场作弊行为
    'NoCheat': 0,
    'FunctionReplace': 101,  # 函数替换
    'PropertyChange': 102,  # 属性修改
    'PropChange': 103,  # 局内道具修改
    'SkillChange': 104,  # 技能属性修改
    'ByteChange': 105,  # 二进制文件修改
    'CodeChange': 106,  # 代码段修改

    'ResourceOverflow': 200,  # 资源掉落超限
    'QuickWin': 201,  # 战斗时间不足，迅速获胜
    'NotConsistent': 202,  # 多人战场发生不一致
    'AceReport': 301,  # ACE的部分上报（这里可能会有多个行为，后面可能需要扩展为20x）
    'PlayerReport': 401,  # 玩家举报
    'RankListTop': 901,  # 排行榜上榜玩家
    'AceCertError': 902,  # ace证书异常

    'CheatSummary': 998,  # 作弊行为汇总
    'CheatOpBlock': 999,  # 作弊上传被屏蔽
}

RAND_ID_2_NAME = {
    100600001: '大年兽正式1期',
    100600002: '大年兽正式2期',
    100600003: '大年兽正式3期',
    100600004: '大年兽正式4期',
    100600005: '大年兽正式5期',
    100600006: '大年兽正式6期',
    100600007: '大年兽正式7期',
    100600008: '大年兽正式8期',
    100600009: '大年兽正式9期',
    100600010: '大年兽正式10期',
    100600011: '大年兽正式11期',
    100600012: '大年兽正式12期',
    100600013: '大年兽正式13期',
    100600014: '大年兽正式14期',
    100600015: '大年兽正式15期',
    100600016: '大年兽正式16期',
    100600017: '大年兽正式17期',
    100700001: '蝾螈日榜1期',
    100700002: '蝾螈日榜2期',
    100700003: '蝾螈日榜3期',
    100700004: '蝾螈日榜4期',
    100700005: '蝾螈日榜5期',
    100700006: '蝾螈日榜6期',
    100700007: '蝾螈日榜7期',
    100700008: '蝾螈日榜8期',
    100700009: '蝾螈日榜9期',
    100800001: '蝾螈累计伤害',
    100500001: '无限boss测试1期',
    100500002: '无限boss测试2期',
    100500003: '无限boss测试3期',
    100500004: '无限boss测试4期',
    100500005: '无限boss测试5期',
    100500006: '无限boss测试6期',
    100500007: '无限boss测试7期',
    100500008: '无限boss测试8期',
    100500009: '无限boss测试9期',
    100500010: '无限boss测试10期',
    100500011: '无限boss测试11期',
    100500012: '无限boss测试12期',
    100500013: '无限boss测试13期',
    100500014: '无限boss测试14期',
    100500015: '无限boss测试15期',
    100500016: '无限boss测试16期',
    100500017: '无限boss测试17期',
    100500018: '无限boss测试18期',
    100500019: '无限boss测试19期',
    100500020: '无限boss测试20期',
    100500021: '无限boss测试21期',
    100500022: '无限boss测试22期',
    100500023: '无限boss测试23期',
    100500024: '无限boss测试24期',
    100500025: '无限boss测试25期',
    100500026: '无限boss测试26期',
    100500027: '无限boss测试27期',
    100500028: '无限boss测试28期',
}

CHEAT_UP_DELAY = 30  # 战斗优先校验的时间间隔（为了处理上传作弊时战斗数据还没上传，校验服可能拿不到数据）

REPORT_CHEAT_DELAY = 60  # 如果上报作弊时战斗数据还没上传，那么增加延迟为60s的一次重传

DO_CLEAR_JOB = False

AUTO_DEL_RANK_IDS = [100500001, 100500002, 100500003, 100500004, 100500005, 100500006, 100500007, 100500008, 100500009,
                     100500010, 100500011, 100500012, 100500013, 100500014, 100500015, 100500016, 100500017, 100500018,
                     100500019, 100500020, 100500021, 100500022, 100500023, 100500024, 100500025, 100500026, 100500027,
                     100500028, 100600001, 100600002, 100600003, 100600004, 100600005, 100600006, 100600007, 100600008,
                     100600009, 100600010, 100600011, 100600012, 100600013, 100600014, 100600015, 100600016, 100600017,
                     100700001, 100700002, 100700003, 100700004, 100700005, 100700006, 100700007, 100700008, 100700009,
                     100800001]

RANK_BATTLE_VALID_TIME = 4 * 60 * 60  # 排行榜上榜记录的有效时间

RANK_CHEAT_PUNISH_THRESHOLD = 1  # 玩家被标记作弊的阈值，超过就会进行自动下榜


RANK_CHEAT_FALSE_TIME_VALID_TIME = 30 * 60  # 短时间作弊不一致超过这个值，判断为误判，不进行自动下榜操作

RANK_CHEAT_FALSE_THRESHOLD = 5  # 短时间作弊不一致超过这个值，判断为误判，不进行自动下榜操作
